#坐标-图 v2.0   10/1/2022-10/2/2022

#介绍
print('坐标-图 v2.0')
print('1 支持16种颜色')
print('\t黑 深红 深绿 土黄 蓝 紫 天蓝 浅灰')
print('\t深灰 亮红 绿 亮黄 浅蓝 红紫 湖蓝 白')
print('2 坐标格式变为{y:{x:color}}')


#参数
#显示方式  0 默认值   1 高亮   4 下划线    5 闪烁    7 反显
#前景色   30 黑色   31 红色   32 绿色    33 黄色   34 蓝色   35 红紫   36 蓝绿   37 白色
#背景色   40 黑色   41 红色   42 绿色    43 黄色   44 蓝色   45 红紫   46 蓝绿   47 白色
#30 - 37 黑 深红 深绿 土黄 蓝 紫 天蓝 浅灰
#30;1 - 37;1 深灰 亮红 绿 亮黄 浅蓝 红紫 湖蓝 白
coordinate = {
    8:{0:37,1:32,2:'32;1',3:'32;1',4:'37;1',5:'32;1',6:32,7:32},
    7:{0:32,1:'32;1',2:32,3:'32;1',4:32,5:'32;1',6:32,7:37},
    6:{0:'32;1',1:'30;1',2:'30;1',3:'32;1',4:32,5:'30;1',6:'30;1',7:'37;1'},
    5:{0:'32;1',1:'30;1',2:30,3:'32;1',4:32,5:30,6:'30;1',7:'32;1'},
    4:{0:'32;1',1:32,2:'32;1',3:'30;1',4:'30;1',5:'37;1',6:32,7:'32;1'},
    3:{0:37,1:32,2:'30;1',3:30,4:30,5:'30;1',6:'32;1',7:'37;1'},
    2:{0:'37;1',1:32,2:30,3:30,4:30,5:30,6:32,7:'32;1'},
    1:{0:'32;1',1:'32;1',2:30,3:'32;1',4:37,5:30,6:32,7:'32;1'},
    -1:{0:30,1:31,2:32,3:33,4:34,5:35,6:36,7:37},
    -2:{0:'30;1',1:'31;1',2:'32;1',3:'33;1',4:'34;1',5:'35;1',6:'36;1',7:'37;1'},
}
y_axis = True


#绘图
for y in range(max(coordinate.keys()),min(coordinate.keys())-1,-1):
    if y_axis == True:   #是否显示y坐标
        print(y,'\t',end='')
    
    if y not in coordinate.keys() or coordinate[y]=={}:
        print('')
        continue    
    former_x = 0
    for x in range(0,max(coordinate[y].keys())+1):
        
        if x in coordinate[y].keys():    
            print('  '*(x-former_x-1),end='')
            print(f'\033[{coordinate[y][x]}m██\033[0m',end='')
            former_x = x
    print('')
print('')